E:\oss\stm32-button-blinky-no-ram\button_blinky_05>make debug
arm-none-eabi-gdb.exe
D:\SW_8\arm_gcc_10.3\10 2021.10\bin\arm-none-eabi-gdb.exe: warning: Couldn't determine a path for the index cache directory.
GNU gdb (GNU Arm Embedded Toolchain 10.3-2021.10) 10.2.90.20210621-git
Copyright (C) 2021 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "--host=i686-w64-mingw32 --target=arm-none-eabi".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<https://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word".
(gdb) file ./obj/button_blinky_05.elf
Reading symbols from ./obj/button_blinky_05.elf...
(gdb) target remote localhost:3333
Remote debugging using localhost:3333
0x0800001c in Reset_Handler () at src/main.c:63
63              *(PRPH_ALIAS_ADDR(GPIOD_ODR_ADDR, LED_RED)) = *(PRPH_ALIAS_ADDR(GPIOA_IDR_ADDR, PUSH_BTN));
(gdb) monitor reset init
Unable to match requested speed 2000 kHz, using 1800 kHz
Unable to match requested speed 2000 kHz, using 1800 kHz
target halted due to debug-request, current mode: Thread
xPSR: 0x01000000 pc: 0x08000008 msp: 0x00020000
Unable to match requested speed 8000 kHz, using 4000 kHz
Unable to match requested speed 8000 kHz, using 4000 kHz
(gdb) monitor flash write_image erase ./obj/button_blinky_05.elf
Adding extra erase range, 0x08000000 .. 0x08000003
auto erase enabled
wrote 16380 bytes from file ./obj/button_blinky_05.elf in 0.512789s (31.194 KiB/s)
(gdb) monitor reset halt
Unable to match requested speed 2000 kHz, using 1800 kHz
Unable to match requested speed 2000 kHz, using 1800 kHz
target halted due to debug-request, current mode: Thread
xPSR: 0x01000000 pc: 0x08000008 msp: 0xfffffffc
(gdb) s
halted: PC: 0x0800000a
Reset_Handler () at src/main.c:39
39          *RegToWrite |= ( 1 << 3) | (1 << 0);
(gdb)
halted: PC: 0x0800000c
halted: PC: 0x08000010
halted: PC: 0x08000012
56          *(PRPH_ALIAS_ADDR(GPIOD_MODER_ADDR, 2 * LED_RED)) = 1;
(gdb)
halted: PC: 0x08000014
halted: PC: 0x08000016
halted: PC: 0x08000018
63              *(PRPH_ALIAS_ADDR(GPIOD_ODR_ADDR, LED_RED)) = *(PRPH_ALIAS_ADDR(GPIOA_IDR_ADDR, PUSH_BTN));
(gdb)
halted: PC: 0x0800001a
halted: PC: 0x0800001c
halted: PC: 0x0800001e
halted: PC: 0x08000020
halted: PC: 0x08000018
halted: PC: 0x0800001a
halted: PC: 0x0800001c
halted: PC: 0x0800001e
halted: PC: 0x08000020
halted: PC: 0x08000018
halted: PC: 0x0800001a
halted: PC: 0x0800001c
halted: PC: 0x0800001e
halted: PC: 0x08000020
halted: PC: 0x08000018
halted: PC: 0x0800001a
halted: PC: 0x0800001c
halted: PC: 0x0800001e
halted: PC: 0x08000020
halted: PC: 0x08000018
halted: PC: 0x0800001a
halted: PC: 0x0800001c
halted: PC: 0x0800001e
halted: PC: 0x08000020
halted: PC: 0x08000018

Program received signal SIGINT, Interrupt.
Reset_Handler () at src/main.c:63
63              *(PRPH_ALIAS_ADDR(GPIOD_ODR_ADDR, LED_RED)) = *(PRPH_ALIAS_ADDR(GPIOA_IDR_ADDR, PUSH_BTN));
(gdb) c
Continuing.

Program received signal SIGINT, Interrupt.
Reset_Handler () at src/main.c:63
63              *(PRPH_ALIAS_ADDR(GPIOD_ODR_ADDR, LED_RED)) = *(PRPH_ALIAS_ADDR(GPIOA_IDR_ADDR, PUSH_BTN));
(gdb) q
A debugging session is active.

        Inferior 1 [Remote target] will be detached.

Quit anyway? (y or n) y
Detaching from program: E:\oss\stm32-button-blinky-no-ram\button_blinky_05\obj\button_blinky_05.elf, Remote target
Ending remote debugging.
[Inferior 1 (Remote target) detached]